# IdeaStatiCa.ConnectionApi.Model.ConPlatePositioning

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConPlatePositioningType** | **ConPlatePositioningEnum** |  | [optional]
**ConcreteBlockIndex** | **int** |  | [optional]
**ConcreteSurface** | **int** |  | [optional]
**PositionX** | **double** |  | [optional]
**PositionY** | **double** |  | [optional]
**RotationAngle** | **double** |  | [optional]
**CoordinateSystem** | **ConLocalCoordinateSystem** |  | [optional]
**Offset** | **Point3D** |  | [optional]
**Rotation** | **Point3D** |  | [optional]
**OnMemberId** | **int** |  | [optional]
**OnMemberOperationId** | **int?** |  | [optional]
**InputMethod** | **ConWorkPlaneMethod** |  | [optional]
**NormalVector** | **Vector3D** |  | [optional]
**PlateOnMemberIndex** | **int** |  | [optional]
**Function** | **ConPlateFunction** |  | [optional]
**Location** | **ConLocation** |  | [optional]
**Pitch** | **double** |  | [optional]
**PlateIndex** | **int** |  | [optional]
**OperationId** | **int?** |  | [optional]
**PlateEdgeIndex** | **int** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)